documents/images/graphio/bxdf/lama_dielectric_instance.dot
digraph {
  rankdir = LR;
    IMPL_lama_dielectric_dielectric_bsdf [label= "layer"];
    IMPL_lama_dielectric_dielectric_bsdf[shape = box];
    IMPL_lama_dielectric_dielectric_bsdf ->     IMPL_lama_dielectric_out;
    IMPL_lama_dielectric_out [label= "out"];
    IMPL_lama_dielectric_out[shape = box]; 
    IMPL_lama_dielectric_reflection_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_reflection_bsdf[shape = box];
    IMPL_lama_dielectric_reflection_bsdf ->     IMPL_lama_dielectric_dielectric_bsdf [label= "top"];
    IMPL_lama_dielectric_dielectric_bsdf [label= "layer"];
    IMPL_lama_dielectric_dielectric_bsdf[shape = box]; 
    IMPL_lama_dielectric_reflectionTintINT [label="reflectionTint"];
    IMPL_lama_dielectric_reflectionTintINT [shape = ellipse];
    IMPL_lama_dielectric_reflection_bsdf [label="dielectric_bsdf"];
    IMPL_lama_dielectric_reflectionTintINT -> IMPL_lama_dielectric_reflection_bsdf [label=".tint"];
    IMPL_lama_dielectric_normalINT [label="normal"];
    IMPL_lama_dielectric_normalINT [shape = ellipse];
    IMPL_lama_dielectric_reflection_bsdf [label="dielectric_bsdf"];
    IMPL_lama_dielectric_normalINT -> IMPL_lama_dielectric_reflection_bsdf [label=".normal"];
    IMPL_lama_dielectric_relative_ior [label= "divide"];
    IMPL_lama_dielectric_relative_ior[shape = box];
    IMPL_lama_dielectric_relative_ior ->     IMPL_lama_dielectric_reflection_bsdf [label= "ior"];
    IMPL_lama_dielectric_reflection_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_reflection_bsdf[shape = box]; 
    IMPL_lama_dielectric_exteriorIORINT [label="exteriorIOR"];
    IMPL_lama_dielectric_exteriorIORINT [shape = ellipse];
    IMPL_lama_dielectric_relative_ior [label="divide"];
    IMPL_lama_dielectric_exteriorIORINT -> IMPL_lama_dielectric_relative_ior [label=".in2"];
    IMPL_lama_dielectric_fresnel_mode_switch [label= "switch"];
    IMPL_lama_dielectric_fresnel_mode_switch[shape = diamond];
    IMPL_lama_dielectric_fresnel_mode_switch ->     IMPL_lama_dielectric_relative_ior [label= "in1"];
    IMPL_lama_dielectric_relative_ior [label= "divide"];
    IMPL_lama_dielectric_relative_ior[shape = box]; 
    IMPL_lama_dielectric_IORINT [label="IOR"];
    IMPL_lama_dielectric_IORINT [shape = ellipse];
    IMPL_lama_dielectric_fresnel_mode_switch [label="switch"];
    IMPL_lama_dielectric_IORINT -> IMPL_lama_dielectric_fresnel_mode_switch [label=".in1"];
    IMPL_lama_dielectric_fresnelModeINT [label="fresnelMode"];
    IMPL_lama_dielectric_fresnelModeINT [shape = ellipse];
    IMPL_lama_dielectric_fresnel_mode_switch [label="switch"];
    IMPL_lama_dielectric_fresnelModeINT -> IMPL_lama_dielectric_fresnel_mode_switch [label=".which"];
    IMPL_lama_dielectric_artistic_ior [label= "artistic_ior"];
    IMPL_lama_dielectric_artistic_ior[shape = box];
    IMPL_lama_dielectric_artistic_ior -> IMPL_lama_dielectric_IMPL_lama_dielectric_artistic_iorior;
    IMPL_lama_dielectric_IMPL_lama_dielectric_artistic_iorior [label= "ior"];
    IMPL_lama_dielectric_IMPL_lama_dielectric_artistic_iorior [label= "ior"];
    IMPL_lama_dielectric_IMPL_lama_dielectric_artistic_iorior [shape = ellipse];
    IMPL_lama_dielectric_IMPL_lama_dielectric_artistic_iorior ->     IMPL_lama_dielectric_fresnel_mode_switch [label= "in2"];
    IMPL_lama_dielectric_fresnel_mode_switch [label= "switch"];
    IMPL_lama_dielectric_fresnel_mode_switch[shape = diamond]; 
    IMPL_lama_dielectric_reflectivity_color [label= "convert"];
    IMPL_lama_dielectric_reflectivity_color[shape = box];
    IMPL_lama_dielectric_reflectivity_color ->     IMPL_lama_dielectric_artistic_ior [label= "reflectivity"];
    IMPL_lama_dielectric_artistic_ior [label= "artistic_ior"];
    IMPL_lama_dielectric_artistic_ior[shape = box]; 
    IMPL_lama_dielectric_reflectivityINT [label="reflectivity"];
    IMPL_lama_dielectric_reflectivityINT [shape = ellipse];
    IMPL_lama_dielectric_reflectivity_color [label="convert"];
    IMPL_lama_dielectric_reflectivityINT -> IMPL_lama_dielectric_reflectivity_color [label=".in"];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped [label= "max"];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped[shape = box];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped ->     IMPL_lama_dielectric_reflection_bsdf [label= "roughness"];
    IMPL_lama_dielectric_reflection_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_reflection_bsdf[shape = box]; 
    IMPL_lama_dielectric_roughness_anisotropic_squared [label= "power"];
    IMPL_lama_dielectric_roughness_anisotropic_squared[shape = box];
    IMPL_lama_dielectric_roughness_anisotropic_squared ->     IMPL_lama_dielectric_roughness_anisotropic_squared_clamped [label= "in1"];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped [label= "max"];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped[shape = box]; 
    IMPL_lama_dielectric_roughness_linear [label= "combine2"];
    IMPL_lama_dielectric_roughness_linear[shape = box];
    IMPL_lama_dielectric_roughness_linear ->     IMPL_lama_dielectric_roughness_anisotropic_squared [label= "in1"];
    IMPL_lama_dielectric_roughness_anisotropic_squared [label= "power"];
    IMPL_lama_dielectric_roughness_anisotropic_squared[shape = box]; 
    IMPL_lama_dielectric_roughnessINT [label="roughness"];
    IMPL_lama_dielectric_roughnessINT [shape = ellipse];
    IMPL_lama_dielectric_roughness_linear [label="combine2"];
    IMPL_lama_dielectric_roughnessINT -> IMPL_lama_dielectric_roughness_linear [label=".in1"];
    IMPL_lama_dielectric_roughness_bitangent_clamped [label= "clamp"];
    IMPL_lama_dielectric_roughness_bitangent_clamped[shape = box];
    IMPL_lama_dielectric_roughness_bitangent_clamped ->     IMPL_lama_dielectric_roughness_linear [label= "in2"];
    IMPL_lama_dielectric_roughness_linear [label= "combine2"];
    IMPL_lama_dielectric_roughness_linear[shape = box]; 
    IMPL_lama_dielectric_roughness_bitangent [label= "add"];
    IMPL_lama_dielectric_roughness_bitangent[shape = box];
    IMPL_lama_dielectric_roughness_bitangent ->     IMPL_lama_dielectric_roughness_bitangent_clamped [label= "in"];
    IMPL_lama_dielectric_roughness_bitangent_clamped [label= "clamp"];
    IMPL_lama_dielectric_roughness_bitangent_clamped[shape = box]; 
    IMPL_lama_dielectric_roughnessINT [label="roughness"];
    IMPL_lama_dielectric_roughnessINT [shape = ellipse];
    IMPL_lama_dielectric_roughness_bitangent [label="add"];
    IMPL_lama_dielectric_roughnessINT -> IMPL_lama_dielectric_roughness_bitangent [label=".in1"];
    IMPL_lama_dielectric_roughness_additional [label= "multiply"];
    IMPL_lama_dielectric_roughness_additional[shape = box];
    IMPL_lama_dielectric_roughness_additional ->     IMPL_lama_dielectric_roughness_bitangent [label= "in2"];
    IMPL_lama_dielectric_roughness_bitangent [label= "add"];
    IMPL_lama_dielectric_roughness_bitangent[shape = box]; 
    IMPL_lama_dielectric_anisotropyINT [label="anisotropy"];
    IMPL_lama_dielectric_anisotropyINT [shape = ellipse];
    IMPL_lama_dielectric_roughness_additional [label="multiply"];
    IMPL_lama_dielectric_anisotropyINT -> IMPL_lama_dielectric_roughness_additional [label=".in1"];
    IMPL_lama_dielectric_delta [label= "ifgreatereq"];
    IMPL_lama_dielectric_delta[shape = diamond];
    IMPL_lama_dielectric_delta ->     IMPL_lama_dielectric_roughness_additional [label= "in2"];
    IMPL_lama_dielectric_roughness_additional [label= "multiply"];
    IMPL_lama_dielectric_roughness_additional[shape = box]; 
    IMPL_lama_dielectric_roughnessINT [label="roughness"];
    IMPL_lama_dielectric_roughnessINT [shape = ellipse];
    IMPL_lama_dielectric_delta [label="ifgreatereq"];
    IMPL_lama_dielectric_roughnessINT -> IMPL_lama_dielectric_delta [label=".in2"];
    IMPL_lama_dielectric_anisotropyINT [label="anisotropy"];
    IMPL_lama_dielectric_anisotropyINT [shape = ellipse];
    IMPL_lama_dielectric_delta [label="ifgreatereq"];
    IMPL_lama_dielectric_anisotropyINT -> IMPL_lama_dielectric_delta [label=".value1"];
    IMPL_lama_dielectric_roughness_inverse [label= "subtract"];
    IMPL_lama_dielectric_roughness_inverse[shape = box];
    IMPL_lama_dielectric_roughness_inverse ->     IMPL_lama_dielectric_delta [label= "in1"];
    IMPL_lama_dielectric_delta [label= "ifgreatereq"];
    IMPL_lama_dielectric_delta[shape = diamond]; 
    IMPL_lama_dielectric_roughnessINT [label="roughness"];
    IMPL_lama_dielectric_roughnessINT [shape = ellipse];
    IMPL_lama_dielectric_roughness_inverse [label="subtract"];
    IMPL_lama_dielectric_roughnessINT -> IMPL_lama_dielectric_roughness_inverse [label=".in2"];
    IMPL_lama_dielectric_tangent_rotate_normalize [label= "normalize"];
    IMPL_lama_dielectric_tangent_rotate_normalize[shape = box];
    IMPL_lama_dielectric_tangent_rotate_normalize ->     IMPL_lama_dielectric_reflection_bsdf [label= "tangent"];
    IMPL_lama_dielectric_reflection_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_reflection_bsdf[shape = box]; 
    IMPL_lama_dielectric_tangent_rotate [label= "rotate3d"];
    IMPL_lama_dielectric_tangent_rotate[shape = box];
    IMPL_lama_dielectric_tangent_rotate ->     IMPL_lama_dielectric_tangent_rotate_normalize [label= "in"];
    IMPL_lama_dielectric_tangent_rotate_normalize [label= "normalize"];
    IMPL_lama_dielectric_tangent_rotate_normalize[shape = box]; 
    IMPL_lama_dielectric_directionINT [label="direction"];
    IMPL_lama_dielectric_directionINT [shape = ellipse];
    IMPL_lama_dielectric_tangent_rotate [label="rotate3d"];
    IMPL_lama_dielectric_directionINT -> IMPL_lama_dielectric_tangent_rotate [label=".in"];
    IMPL_lama_dielectric_normalINT [label="normal"];
    IMPL_lama_dielectric_normalINT [shape = ellipse];
    IMPL_lama_dielectric_tangent_rotate [label="rotate3d"];
    IMPL_lama_dielectric_normalINT -> IMPL_lama_dielectric_tangent_rotate [label=".axis"];
    IMPL_lama_dielectric_tangent_rotate_degree_offset [label= "subtract"];
    IMPL_lama_dielectric_tangent_rotate_degree_offset[shape = box];
    IMPL_lama_dielectric_tangent_rotate_degree_offset ->     IMPL_lama_dielectric_tangent_rotate [label= "amount"];
    IMPL_lama_dielectric_tangent_rotate [label= "rotate3d"];
    IMPL_lama_dielectric_tangent_rotate[shape = box]; 
    IMPL_lama_dielectric_tangent_rotate_degree [label= "multiply"];
    IMPL_lama_dielectric_tangent_rotate_degree[shape = box];
    IMPL_lama_dielectric_tangent_rotate_degree ->     IMPL_lama_dielectric_tangent_rotate_degree_offset [label= "in1"];
    IMPL_lama_dielectric_tangent_rotate_degree_offset [label= "subtract"];
    IMPL_lama_dielectric_tangent_rotate_degree_offset[shape = box]; 
    IMPL_lama_dielectric_rotationINT [label="rotation"];
    IMPL_lama_dielectric_rotationINT [shape = ellipse];
    IMPL_lama_dielectric_tangent_rotate_degree [label="multiply"];
    IMPL_lama_dielectric_rotationINT -> IMPL_lama_dielectric_tangent_rotate_degree [label=".in1"];
    IMPL_lama_dielectric_transmission_layer [label= "layer"];
    IMPL_lama_dielectric_transmission_layer[shape = box];
    IMPL_lama_dielectric_transmission_layer ->     IMPL_lama_dielectric_dielectric_bsdf [label= "base"];
    IMPL_lama_dielectric_dielectric_bsdf [label= "layer"];
    IMPL_lama_dielectric_dielectric_bsdf[shape = box]; 
    IMPL_lama_dielectric_transmission_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_transmission_bsdf[shape = box];
    IMPL_lama_dielectric_transmission_bsdf ->     IMPL_lama_dielectric_transmission_layer [label= "top"];
    IMPL_lama_dielectric_transmission_layer [label= "layer"];
    IMPL_lama_dielectric_transmission_layer[shape = box]; 
    IMPL_lama_dielectric_transmissionTintINT [label="transmissionTint"];
    IMPL_lama_dielectric_transmissionTintINT [shape = ellipse];
    IMPL_lama_dielectric_transmission_bsdf [label="dielectric_bsdf"];
    IMPL_lama_dielectric_transmissionTintINT -> IMPL_lama_dielectric_transmission_bsdf [label=".tint"];
    IMPL_lama_dielectric_normalINT [label="normal"];
    IMPL_lama_dielectric_normalINT [shape = ellipse];
    IMPL_lama_dielectric_transmission_bsdf [label="dielectric_bsdf"];
    IMPL_lama_dielectric_normalINT -> IMPL_lama_dielectric_transmission_bsdf [label=".normal"];
    IMPL_lama_dielectric_relative_ior [label= "divide"];
    IMPL_lama_dielectric_relative_ior[shape = box];
    IMPL_lama_dielectric_relative_ior ->     IMPL_lama_dielectric_transmission_bsdf [label= "ior"];
    IMPL_lama_dielectric_transmission_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_transmission_bsdf[shape = box]; 
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped [label= "max"];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped[shape = box];
    IMPL_lama_dielectric_roughness_anisotropic_squared_clamped ->     IMPL_lama_dielectric_transmission_bsdf [label= "roughness"];
    IMPL_lama_dielectric_transmission_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_transmission_bsdf[shape = box]; 
    IMPL_lama_dielectric_tangent_rotate_normalize [label= "normalize"];
    IMPL_lama_dielectric_tangent_rotate_normalize[shape = box];
    IMPL_lama_dielectric_tangent_rotate_normalize ->     IMPL_lama_dielectric_transmission_bsdf [label= "tangent"];
    IMPL_lama_dielectric_transmission_bsdf [label= "dielectric_bsdf"];
    IMPL_lama_dielectric_transmission_bsdf[shape = box]; 
    IMPL_lama_dielectric_interior_vdf [label= "anisotropic_vdf"];
    IMPL_lama_dielectric_interior_vdf[shape = box];
    IMPL_lama_dielectric_interior_vdf ->     IMPL_lama_dielectric_transmission_layer [label= "base"];
    IMPL_lama_dielectric_transmission_layer [label= "layer"];
    IMPL_lama_dielectric_transmission_layer[shape = box]; 
    IMPL_lama_dielectric_scatterAnisotropyINT [label="scatterAnisotropy"];
    IMPL_lama_dielectric_scatterAnisotropyINT [shape = ellipse];
    IMPL_lama_dielectric_interior_vdf [label="anisotropic_vdf"];
    IMPL_lama_dielectric_scatterAnisotropyINT -> IMPL_lama_dielectric_interior_vdf [label=".anisotropy"];
    IMPL_lama_dielectric_absorption_vector [label= "convert"];
    IMPL_lama_dielectric_absorption_vector[shape = box];
    IMPL_lama_dielectric_absorption_vector ->     IMPL_lama_dielectric_interior_vdf [label= "absorption"];
    IMPL_lama_dielectric_interior_vdf [label= "anisotropic_vdf"];
    IMPL_lama_dielectric_interior_vdf[shape = box]; 
    IMPL_lama_dielectric_absorption [label= "divide"];
    IMPL_lama_dielectric_absorption[shape = box];
    IMPL_lama_dielectric_absorption ->     IMPL_lama_dielectric_absorption_vector [label= "in"];
    IMPL_lama_dielectric_absorption_vector [label= "convert"];
    IMPL_lama_dielectric_absorption_vector[shape = box]; 
    IMPL_lama_dielectric_absorptionColorINT [label="absorptionColor"];
    IMPL_lama_dielectric_absorptionColorINT [shape = ellipse];
    IMPL_lama_dielectric_absorption [label="divide"];
    IMPL_lama_dielectric_absorptionColorINT -> IMPL_lama_dielectric_absorption [label=".in1"];
    IMPL_lama_dielectric_absorptionRadiusINT [label="absorptionRadius"];
    IMPL_lama_dielectric_absorptionRadiusINT [shape = ellipse];
    IMPL_lama_dielectric_absorption [label="divide"];
    IMPL_lama_dielectric_absorptionRadiusINT -> IMPL_lama_dielectric_absorption [label=".in2"];
    IMPL_lama_dielectric_scatter_vector [label= "convert"];
    IMPL_lama_dielectric_scatter_vector[shape = box];
    IMPL_lama_dielectric_scatter_vector ->     IMPL_lama_dielectric_interior_vdf [label= "scattering"];
    IMPL_lama_dielectric_interior_vdf [label= "anisotropic_vdf"];
    IMPL_lama_dielectric_interior_vdf[shape = box]; 
    IMPL_lama_dielectric_scatterColorINT [label="scatterColor"];
    IMPL_lama_dielectric_scatterColorINT [shape = ellipse];
    IMPL_lama_dielectric_scatter_vector [label="convert"];
    IMPL_lama_dielectric_scatterColorINT -> IMPL_lama_dielectric_scatter_vector [label=".in"];
}
